```
➜ lab-l100 (main) ✔ terraform apply --auto-approve --var-file=example.tfvars -refresh=false
Terraform used the selected providers to generate the following execution plan. Resource
actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.mgmt_host.azurerm_network_interface.this[0] will be created
  + resource "azurerm_network_interface" "this" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = true
      + enable_ip_forwarding          = true
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "eastus2"
      + mac_address                   = (known after apply)
      + name                          = "linux-mgmt"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "l100-rg"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + name                          = "primary"
          + primary                       = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "dynamic"
          + private_ip_address_version    = "IPv4"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = "/subscriptions/xxx-xxx-xxx/resourceGroups/l100-rg/providers/Microsoft.Network/virtualNetworks/vnet-vmseries/subnets/subnet-mgmt"
        }
    }

  # module.mgmt_host.azurerm_public_ip.this["0"] will be created
  + resource "azurerm_public_ip" "this" {
      + allocation_method       = "Static"
      + availability_zone       = "1"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus2"
      + name                    = "linux-mgmt"
      + resource_group_name     = "l100-rg"
      + sku                     = "Standard"
      + zones                   = (known after apply)
    }

  # module.mgmt_host.azurerm_virtual_machine.this will be created
  + resource "azurerm_virtual_machine" "this" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = true
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "eastus2"
      + name                             = "mgmt-host"
      + network_interface_ids            = (known after apply)
      + primary_network_interface_id     = (known after apply)
      + resource_group_name              = "l100-rg"
      + vm_size                          = "Standard_D3_v2"
      + zones                            = [
          + "1",
        ]

      + identity {
          + principal_id = (known after apply)
          + type         = "SystemAssigned"
        }

      + os_profile {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }

      + storage_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "StandardSSD_LRS"
          + name                      = "mgmt-host-vhd"
          + os_type                   = "Linux"
          + write_accelerator_enabled = false
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ mgmt_host_public_ip = "20.110.161.194" -> (known after apply)
module.mgmt_host.azurerm_public_ip.this["0"]: Creating...
module.mgmt_host.azurerm_public_ip.this["0"]: Creation complete after 5s [id=/subscriptions/xxx-xxx-xxx/resourceGroups/l100-rg/providers/Microsoft.Network/publicIPAddresses/linux-mgmt]
module.mgmt_host.azurerm_network_interface.this[0]: Creating...
module.mgmt_host.azurerm_network_interface.this[0]: Creation complete after 4s [id=/subscriptions/xxx-xxx-xxx/resourceGroups/l100-rg/providers/Microsoft.Network/networkInterfaces/linux-mgmt]
module.mgmt_host.azurerm_virtual_machine.this: Creating...
module.mgmt_host.azurerm_virtual_machine.this: Still creating... [10s elapsed]
module.mgmt_host.azurerm_virtual_machine.this: Still creating... [20s elapsed]
module.mgmt_host.azurerm_virtual_machine.this: Still creating... [30s elapsed]
module.mgmt_host.azurerm_virtual_machine.this: Still creating... [40s elapsed]
module.mgmt_host.azurerm_virtual_machine.this: Still creating... [50s elapsed]
module.mgmt_host.azurerm_virtual_machine.this: Creation complete after 51s [id=/subscriptions/xxx-xxx-xxx/resourceGroups/l100-rg/providers/Microsoft.Compute/virtualMachines/mgmt-host]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```